app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.user_email = current_user.email
    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("user_email", "body", "idea_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_email", ""], ["body", "teste\r\n"], ["idea_id", 11], ["created_at", "2019-12-03 00:07:19.934171"], ["updated_at", "2019-12-03 00:07:19.934171"]]

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "teste2"], ["updated_at", "2019-12-03 01:55:10.545915"], ["id", 15]]