app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all
---
SELECT "ideas".* FROM "ideas" WHERE (name like '%perdido%')

  def show
    @comments = @idea.comments.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 11]]

  def create
    @idea = Idea.new(idea_params)
    @idea.user_id = current_user.id
    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @idea.update(idea_params)
---
UPDATE "ideas" SET "description" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["description", "Perdidamente apaixonado por vc <3 sz"], ["updated_at", "2019-12-02 03:06:59.347084"], ["id", 11]]